{
    "0":{
        "nom":"Chât'Odyssée", 
        "visuel":"public/images/chat_odyssee.png", 
        "resume":"Chât'Odyssée est une application web de carnet de voyage où chacun peut consigner ses expéditions dans les châteaux de la région Auvergne-Rhônes-Alpes ainsi que se renseigner sur les prochains château à visiter. Ce projet fût réalisé en équipe de 6 dans le cadre de la \"SAE\" du troisième semestre du BUT dont le thème était \"Valoriser le patrimoine culturelle\".", 
        "desc":"Chât'Odyssée est le premier projet que j'ai réalisé en BUT, nous avons pu mettre en pratique nos connaissances sur toutes les étapes de projet, du cadrage du projet à sa réalisation.", 
        "contribution":"Ce projet étant le tout premier auquel j'ai pu participer, je manquais d'expérience vis-à-vis de mes collègues. J'ai donc comblé ce manque d'expérience en me concentrant sur ce que je connaissais, en amont du développement, je me suis donc occupée de la récolte des données sur les châteaux, et leur formatage via le logiciel Talend. Ensuite, durant le dévellopement de l'application, j'ai pu mettre en place la recherche de château ainsi que l'affichage des activités des amis sur la page d'accueil.", 
        "langages":{
            "0":"PHP",
            "1":"HTML",
            "2":"CSS",
            "3":"JavaScript",
            "4":"SQL"
        },
        "images":{
            "0":{
                "nom":"La page d'accueil",
                "lien":"public/images/placeholder.png"
            },
            "1":{
                "nom":"Le carnet de voyage",
                "lien":"public/images/placeholder.png"
            },
            "2":{
                "nom":"La page de recherche",
                "lien":"public/images/placeholder.png"
            },
            "3":{
                "nom":"Le profil de l'utilisateur",
                "lien":"public/images/placeholder.png"
            },
            "4":{
                "nom":"Les activités et notifications",
                "lien":"public/images/placeholder.png"
            }
        },
        "liens":{
        }
    },

    "1":{
        "nom":"Deus Ex Machina", 
        "visuel":"public/images/illu3DS.jpg", 
        "resume":"Ce jeu est encore à l'étape de conception, il sera réalisé par moi et 3 de mes amis, chacun nous occupant de notre spécialité: code, dessin, musique... \nNous comptons organiser un \"bootcamp\" cet été où nous projetons d'en développer une démo en une semaine.", 
        "desc":"Ce projet nous tiens énormément à coeur à mon meilleur ami et moi, cela fait maintenant 4 ans que nous révons de créer notre jeu avec toutes les fonctionnalités que nous aimons. Mais cela fait seulement depuis septembre dernier que nous traitons réellement ce rêve comme un projet concret. Ce projet me permet également de mettre en pratique les méthodes de gestion de projet que j'apprends en BUT et ailleurs.", 
        "contribution":"Mon rôle dans ce projet est celui de co-cheffe de projet, développeuse, et scénariste. J'écris actuellement le scénario du jeu avec mon meilleur ami, tout en me familiarisant avec le fonctionnement d'Unity pour 3DS. J'apprends également la modélisation 3d sur Blender afin de pouvoir aider plus tard notre game designer si nécessaire",
        "langages":{
            "0":"C++",
            "1":"C#"
        },
        "images":{
            "0":{
                "nom":"Notre équipe",
                "lien":"public/images/nous.png"
            },
            "1":{
                "nom":"Début de conception des mini-jeux",
                "lien":"public/images/placeholder.png"
            },
            "2":{
                "nom":"ClickUp et l'organisation du projet",
                "lien":"public/images/placeholder.png"
            },
            "3":{
                "nom":"Le premier test sur 3DS",
                "lien":"public/images/testunity.jng"
            },
            "4":{
                "nom":"",
                "lien":"public/images/placeholder.png"
            }
        },
        "liens":{
            "0":{
                "nom":"La page Github",
                "lien":"https://github.com/LievreVolant"
            }
        }
    },

    "2":{
        "nom":"Alchi'Mix", 
        "visuel":"public/images/alchimix_res.png", 
        "resume":"Projet réalisé en quelques jours afin de se familiariser avec l'utilisation des APIs en JavaScript",
        "desc":"Alchi'Mix est une application permettant de consulter les données de l'API TheCocktailDB, elle permet également de créer ses propres cocktails de façon ludique. Nous avons réalisé cette application en équipe de 3.", 
        "contribution":"Je me suis occupée de la partie création de cocktails. J'ai récupéré les ingrédients grâce au service principal réalisé par une autre membre de notre équipe. J'ai ensuite généré un cocktail aléatoire à afficher : une ilustration aléatoire parmis celles de application et un nom constitué d'un préfixe aléatoire et un des ingrédient du cocktail. Nous souhaitions faire en sorte d'afficher les données de l'API si l'utilisateur choississais les ingrédients d'un cocktail existant mais cela nécessitait trop d'appels pour effectuer la correspondance des ingrédients",
        "langages":{
            "0":"HTML",
            "1":"CSS",
            "2":"JavaScript"
        },
        "images":{
            "0":{
                "nom":"La page d'accueil",
                "lien":"public/images/placeholder.png"
            },
            "1":{
                "nom":"La page de recherche",
                "lien":"public/images/placeholder.png"
            },
            "2":{
                "nom":"Création d'un cocktail",
                "lien":"public/images/alchimix_crea.png"
            },
            "3":{
                "nom":"Résultat de la création de cocktail",
                "lien":"public/images/alchimix_res.png"
            },
            "4":{
                "nom":"Affichage des informations d'un cocktail",
                "lien":"public/images/placeholder.png"
            }
        },
        "liens":{
            "0":{
                "nom":"TheCocktailDB",
                "lien":"https://www.thecocktaildb.com/"
            }
        }
    },

    "3":{
        "nom":"Carnet de recherche de stage", 
        "visuel":"public/images/icon_carnet.png", 
        "resume":"Second projet réalisé en BUT. Prenant place durant le semestre contenant le stage de fin d'année, ce projet consistait à améliorer une application existante.", 
        "desc":"L'objectif de ce projet était d'améliorer une application existante de gestion de stages par rapport à des critères de qualités choisis par nos soins. Notre groupe a choisis de se concentrer sur les critères de ..., ... et .... L'application possède un back-office web pour le responsable des stages, codé en PHP Symfony, et un front office Android, destiné aux étudiants, codé en Java et UML.", 
        "contribution":"Je me suis occupée de réaliser quelques unes des interfaces du front-office Android. J'ai également réalisé les pages d'affichages d'offres de stage et de demandes de stage en cours. Enfin j'ai apporté mon aide pour la réalisation du visuel de certaines des autres pages de l'application mobile.",
        "langages":{
            "0":"PHP",
            "1":"Symfony",
            "2":"Java",
            "3":"UML"
        },
        "images":{
            "0":{
                "nom":"Maquette des interfaces améliorées",
                "lien":"public/images/maquettesameliorees.png"
            },
            "1":{
                "nom":"Liste des avancées des étudiants",
                "lien":"public/images/placeholder.png"
            },
            "2":{
                "nom":"Page d'accueil et liste d'offres mobile",
                "lien":"public/images/placeholder.png"
            },
            "3":{
                "nom":"",
                "lien":"public/images/placeholder.png"
            },
            "4":{
                "nom":"",
                "lien":"public/images/placeholder.png"
            }
        },
        "liens":{
        }
    },

    "4":{
        "nom":"BloomyFleet", 
        "visuel":"public/images/placeholder.jpg", 
        "resume":"BloomyFleet est l'application que j'ai réalisé au cours de mon stage de fin de deuxième année de BUT. J'ai réalisé cette mission chez CBA Informatique Libérale à Avignon.", 
        "desc":"BloomyFleet permets aux développeurs et au personnel du SAV de CBA de contrôler facilement le parc des \"Bloomy\" de l'entreprise. Nous avons réalisé cette application en binôme avec un autre stagiaire de l'entreprise, lui s'occupant du back-end et moi du front-end. À l'image du reste des équipe de l'entreprise nous avons travaillé selon la méthode agile Scrum", 
        "contribution":"J'ai développé le front de l'aplication en Angular et GraphQL pour les appels à la base de données. J'ai appris de zéro Angular, TypeScript et GraphQl pour cette mission, ce qui l'a rendue extrêment interressante et bénéfique pour moi. J'ai également pu appliquer ce que j'avais appris en cours plus tôt dans l'année sur les méthodes agiles et les logiciels de gestion de projet tels Jira et ClickUp. J'ai énormément appris durant ces 2 mois sur absolument tout les plans possibles et je suis très reconnaissante de l'expérience qu'il m'a apportée.",
        "langages":{
            "0":"TypeScript",
            "1":"Angular",
            "2":"GraphQl"
        },
        "images":{
            "0":{
                "nom":"Un Bloomy",
                "lien":"public/images/placeholder.png"
            },
            "1":{
                "nom":"Liste des Bloomy",
                "lien":"public/images/bloomy_bloomydetails.png"
            },
            "2":{
                "nom":"Tableau de bord",
                "lien":"public/images/bloomy_dashboard.png"
            },
            "3":{
                "nom":"Liste des utilisateurs",
                "lien":"public/images/bloomy_edituser.png"
            },
            "4":{
                "nom":"Formulaire de nouvel utilisateur",
                "lien":"public/images/bloomy_form.png"
            }
        },
        "liens":{
            "0":{
                "nom":"CBA",
                "lien":"https://www.cbainfo.fr/"
            }
        }
    }
}
